# Арсенал героя 2.0
# Демонстрирует работу с кортежами

# Создадим список с несколькими элементами и выведем его с помощью цикла for
inventory = ['меч','кольчуга','щит','целебное снадобье']
print('\nИтак, в вашем арсенале: ')
for item in inventory:
    print(item)
input('\nНажмите Enter, чтобы продолжить.')

# найдём длину кортежа
print('Сейчас в вашем распоряжении', len(inventory), 'предмета/-ов.')
input('\nНажмите Enter, чтобы продолжить.')

# проверка на принадлежность кортежу с помощью in
if 'целебное снадобье' in inventory:
    print('Вы еще поживёте и повоюете.')

# вывод одного элемента с определенным индексов
index = int(input('\nВведите индекс одного из предметов арсенала:'))
print ('Под индексом' , index, 'в арсенале находится' , inventory[index])

# отобразим срез
start = int(input('\nВведите начальный индекс среза'))
finish = int(input('\nВведите конечный индекс среза'))
print('Срез inventory[', start, ':', finish, '] -это ', end = ' ')
print(inventory[start:finish])
input('\n\nНажмите Enter, чтобы продолжить.')
        
# соединим два кортежа
chest = ['золото', 'драгоценные камни']
print('Вы нашли ларец. Вот что в нем есть.')
print(chest)
print('Вы приобщили содержимое ларца к своему арсеналу')
inventory += chest
print('Теперь в вашем распоряжении: ')
print(inventory)
input('\n\nНажмите Enter, чтобы продолжить')

# присваиваем значение элементу по индексу
print('Вы обменяли меч на арбалет')
inventory[0] = 'арбалет'
print('Теперь ваш арсенал содержит след элементы: ')
print(inventory)
input('\n\nНажмите Enter, чтобы продолжить')

#приписал значение элементам по срезу индексов
print('За золото и драгоценные камни вы купили магический кристалл, способный предсказывать будущее.')
inventory[4:6] = ['Магический кристалл']
print('Теперь в вашем распоряжении: ')
print(inventory)
input('\n\n Нажмите Enter, чтобы продолжить')

# удалил срез
print ('Воры лишили вас арбалета и кольчуги')
del inventory[:2]
print('В арсенале теперь только: ')
print(inventory)
input('\n\nНажмите Enter, чтобы выйти.')

